app/views/posts/index.html.erb

      <h2><%= @user.name %></h2>
      <p>Number of posts: <%= @user.posts.count %></p>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 3]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 3]]

  <div class='user_posts'>
    <% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 6]]

        <span class='like_comment'>
          Comments: <%= post.comments.count %>,
          Likes: <%= post.likes.count %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 1], ["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 3]]