app/views/posts/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
---
    <h6 class='coms'>COMMENTS</h6>
    <% if @post.comments.length == 0 %>

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
    <% else %>
      <% @post.comments.includes(:user).each do |comment| %>