app/controllers/comments_controller.rb

  def create
    post = Post.find(params[:post_id])

    comment = Comment.new(comment_params)
    comment.user = current_user
    comment.post  = post

    if comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "1"], ["created_at", "2022-11-02 18:40:44.733878"], ["updated_at", "2022-11-02 18:40:44.733878"], ["user_id", 1], ["post_id", 3]]

  def destroy
    @comment = Comment.find(params[:id])
    if @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]