app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-10-28 15:30:27.074792"], ["updated_at", "2022-10-28 15:30:27.074792"], ["user_id", 2], ["post_id", 1]]
---
  def create
    @post = Post.find(params[:post_id])
    @user = current_user
    @like = Like.new(user_id: @user.id, post_id: @post.id)

    if @like.save
      @post = Post.find(params[:post_id])