app/controllers/posts_controller.rb

  def destroy
    @post = Post.find(params[:id])
    if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]