app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]
---
  def index
    @user = User.includes(:posts).find(params[:user_id])