app/models/comment.rb

UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2022-11-03 10:07:37.464378"], ["id", 4]]
---
  def update_comments_counter
    posts.increment!(:comments_counter)