app/models/post.rb

  def update_posts_counter
    user.update(posts_counter: user.posts.count)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
UPDATE "users" SET "posts_counter" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["posts_counter", 1], ["updated_at", "2022-11-02 18:22:33.893550"], ["id", 1]]